![png](Documents/Data/Books.png)

In [18]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [22]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection_str = "mysql+pymysql://root:Runner1!28@localhost/books"

In [23]:
engine = create_engine(connection_str)

In [25]:
create_database(connection_str)

In [26]:
database_exists(connection_str)

True

In [4]:
import pandas as pd

## Load Data

In [10]:
authors = pd.read_csv("/Users/samlagana/Documents/Data/authors.csv")

In [11]:
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [12]:
books = pd.read_csv("/Users/samlagana/Documents/Data/books.csv")
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [13]:
favorites = pd.read_csv("/Users/samlagana/Documents/Data/favorites.csv")
favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [14]:
users = pd.read_csv("/Users/samlagana/Documents/Data/users.csv")
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

## Add to database

In [27]:
authors.to_sql("authors", engine, if_exists = "replace")

In [29]:
# Confirm 
q ="""SELECT * FROM authors;"""
pd.read_sql(q,engine)

   index  id        author_name
0      0   1       Stephen King
1      1   2  F.Scott Fitgerald
2      2   3        Jack London
3      3   4        Jane Austen
4      4   5       Mary Shelley

In [30]:
books.to_sql("books", engine, if_exists = "replace")

In [31]:
# Confirm 
q = """SELECT * FROM books;"""
pd.read_sql(q,engine)

   index  id                 title  author_id
0      0   1           The Shining          1
1      1   2                    It          1
2      2   3      The Great Gatsby          2
3      3   4  The Call of the Wild          3
4      4   5   Pride and Prejudice          4
5      5   6          Frankenstein          5

In [32]:
favorites.to_sql("favorites", engine, if_exists = "replace")

In [33]:
# Confirm 
q = """SELECT * FROM favorites;"""
pd.read_sql(q,engine)

   index  user_id  book_id
0      0        1        1
1      1        1        2
2      2        1        3
3      3        2        4
4      4        2        5
5      5        3        5
6      6        3        6

In [34]:
users.to_sql("users", engine, if_exists = "replace")

In [35]:
# Confirm
q = """SELECT * FROM users;"""
pd.read_sql(q,engine)

   index  id first_name  last_name                 email
0      0   1       John        Doe          JD@books.com
1      1   2      Robin      Smith       Robin@books.com
2      2   3     Gloria  Rodriguez  grodriquez@books.com